import React, { useEffect, useState } from 'react'
import Layout from '../components/layout'
import BreadcrumbsNavigation from '../components/navigation'
import { Stack } from '@mui/system'
import ChartLine from '../components/chart-line'
import { Typography } from '@mui/material'
import axios from 'axios'
import URLS from '../urls'
import CompanyCard from '../components/company-card'
import { Link } from 'react-router-dom'

const data = {
    x: [0, 24, 48, 72, 96, 120, 144, 168, 192, 216],
    ys: [['id-2',
        [0.8216390565700177,
            0.6896631635745637,
            0.6044298756441857,
            0.5351936121246619,
            0.481355745164517,
            0.43067581025522667,
            0.39245444650900935,
            0.3450593106227333,
            0.2952322105751943,
            0.2517235338359281]],
    ['id-20',
        [0.8437237509758839,
            0.7254458149137603,
            0.6473334701643177,
            0.5828110954761642,
            0.5318150681737336,
            0.4830966636751019,
            0.44584581528804224,
            0.39891307701721995,
            0.34864658032082785,
            0.30381966238727465]],
    ['id-292',
        [0.8330459284925551,
            0.7080496965360087,
            0.6263798810868887,
            0.5594581824001327,
            0.5069773269261929,
            0.45719412620253536,
            0.41937942617650203,
            0.37209882485356555,
            0.3219094125536343,
            0.2776013337000283]],
    ['id-205',
        [0.8330459284925551,
            0.7080496965360087,
            0.6263798810868887,
            0.5594581824001327,
            0.5069773269261929,
            0.45719412620253536,
            0.41937942617650203,
            0.37209882485356555,
            0.3219094125536343,
            0.2776013337000283]],
    ['id-101',
        [0.8384120346991546,
            0.7167697861021168,
            0.6368607998125836,
            0.5711163704311971,
            0.5193552312859046,
            0.47007912001890845,
            0.4325248416399085,
            0.3853886415091979,
            0.33512696632692346,
            0.29052832443656756]],
    ['id-28',
        [0.8437237509758839,
            0.7254458149137603,
            0.6473334701643177,
            0.5828110954761642,
            0.5318150681737336,
            0.4830966636751019,
            0.44584581528804224,
            0.39891307701721995,
            0.34864658032082785,
            0.30381966238727465]],
    ['id-217',
        [0.8330459284925551,
            0.7080496965360087,
            0.6263798810868887,
            0.5594581824001327,
            0.5069773269261929,
            0.45719412620253536,
            0.41937942617650203,
            0.37209882485356555,
            0.3219094125536343,
            0.2776013337000283]],
    ['id-318',
        [0.8330459284925551,
            0.7080496965360087,
            0.6263798810868887,
            0.5594581824001327,
            0.5069773269261929,
            0.45719412620253536,
            0.41937942617650203,
            0.37209882485356555,
            0.3219094125536343,
            0.2776013337000283]],
    ['id-189',
        [0.8286465860005964,
            0.7009342738472144,
            0.6178612867108798,
            0.5500168666261729,
            0.49698512853617477,
            0.4468273705348939,
            0.40883265486675224,
            0.3614776992824396,
            0.31139553309081885,
            0.2673677573674987]
    ]]

}

function AnalysisPage() {
    const [selectedCompany, setSelectedCompany] = useState(null)
    const [companyData, setCompanyData] = useState(null)

    useEffect(() => {
        axios
            .get(URLS.COMPANY(selectedCompany))
            .then((res) => {
                setCompanyData(res.data)
            })
            .catch((err) => {
                console.log(err)
            })
    }, [selectedCompany])

    return (
        <Layout pageName='Аналитика'>
            <Stack spacing={2}>
                <BreadcrumbsNavigation
                    items={[
                        { name: 'Главная', path: '/' },
                        { name: 'Аналитика', path: '/analysis' },
                    ]} />

                <Typography variant="h5">Сравнительный анализ выживаемости объекта</Typography>
                <ChartLine
                    data={data}
                    height={400}
                    xAxis={[{
                        data: data.x,
                        label: 'Дни',
                    }]}
                    yAxis={[{
                        data: data.ys,
                        label: 'Вероятность',
                    }]}
                    onLineClick={(e, data) => {
                        console.log(data);
                        setSelectedCompany(data['seriesId'].split('id-')[1])
                    }}
                />
                {companyData &&
                    <Link to={`/company/${companyData.id}`} style={{ textDecoration: 'none' }}>
                        <CompanyCard {...companyData} />
                    </Link>}
            </Stack>
        </Layout>
    )
}

export default AnalysisPage
