import React, { useEffect } from 'react'
import Layout from '../components/layout'
import { Breadcrumbs, Grid, Typography } from '@mui/material'
import { Link, useParams } from 'react-router-dom'
import ChartLine from '../components/chart-line'
import CompanyCard from '../components/company-card'
import axios from 'axios'
import URLS from '../urls'
import BreadcrumbsNavigation from '../components/navigation';

function CompanyPage() {
    const data = {
        x: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
        ys: [[0.8265797781967493,
            0.6984861191688058,
            0.6168909598002761,
            0.546995881002177,
            0.4948335527747624,
            0.4460363625375766,
            0.40620900027257417,
            0.3659145299485177,
            0.3157735102993785,
            0.2702546842445895],
        [0.8717453981179735,
            0.772637651769195,
            0.706688282653015,
            0.6482647617776479,
            0.6032191967161754,
            0.5598582146604117,
            0.5235030571161797,
            0.4856035324462853,
            0.4368157046898169,
            0.39058629516403043],
        [0.8820673766546492,
            0.7900233176069208,
            0.7281839936547436,
            0.6729947197691216,
            0.6301364017188885,
            0.5886201603479365,
            0.5536048890359183,
            0.5168603488024889,
            0.4692036852877602,
            0.4236174909131559],
        [0.9017386473013241,
            0.8236043019225493,
            0.7701616642872567,
            0.7218021022349785,
            0.6837405160982117,
            0.6464338202680334,
            0.6146185689857994,
            0.5808171621896117,
            0.5363585929135178,
            0.493073422272939],
        [0.6813431575297533,
            0.48188257811382584,
            0.3739694555522089,
            0.2923538949019285,
            0.23837173063085046,
            0.1929183026398831,
            0.15933258596725328,
            0.1288996178456643,
            0.0954507576924455,
            0.06951940386278842],
        [0.6515926562131374,
            0.44176712164361515,
            0.332573037321133,
            0.25237813647093266,
            0.20082385925511662,
            0.15847315137780077,
            0.12790403750798676,
            0.10091080466168216,
            0.07208813186878774,
            0.050555034578781945],
        [0.6087455288479271,
            0.38662783177014587,
            0.27777798753749516,
            0.2013676366413545,
            0.1543510974899432,
            0.11716404227850082,
            0.09127098866726513,
            0.0692953335569709,
            0.04684577299021368,
            0.03100000634330684],
        [0.8690173266305273,
            0.7680698176511619,
            0.7010678544690979,
            0.6418288008526222,
            0.5962417248217821,
            0.5524330888651129,
            0.5157605536650169,
            0.47759737688643317,
            0.4285680810412737,
            0.3822266801910584]]

    }

    let { companyId } = useParams();
    const [companyData, setCompanyData] = React.useState(null);

    useEffect(() => {
        axios
            .get(`${URLS.COMPANY(companyId)}`)
            .then(res => {
                setCompanyData(res.data);
            })
            .catch(err => {
                console.log(err);
            })
    }, []);

    return (
        <Layout pageName={companyData?.name}>
            <BreadcrumbsNavigation items={[
                { name: 'Структура', path: '/accounts' },
                // TODO: получать айди динамически из ответа
                { name: 'Название управления', path: '/accounts/id' },
                { name: companyData?.name },
            ]} />
            <Grid container spacing={1}>
                <Grid container item xs={3}>
                    <CompanyCard {...companyData} />
                </Grid>
                <Grid container item xs>
                    <ChartLine data={data} height={500} />
                </Grid>
            </Grid>
        </Layout>
    )
}

export default CompanyPage
